
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ДвиженияДС.Записывать = Истина;
	Движения.БюджетРасходы.Записывать = Истина;
	
	Для Каждого ТекСтрокаГрафик Из График Цикл
		Движение = Движения.ДвиженияДС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ТекСтрокаГрафик.Период;
		Движение.Статья = Статья;
		Движение.Кошелек = КошелекОткуда;
		Движение.Сумма = ТекСтрокаГрафик.Сумма; 
		
		Если не ЭтоПеревод Тогда
			Движение = Движения.БюджетРасходы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ТекСтрокаГрафик.Период;
			Движение.Статья = Статья;
			Движение.Сумма = ТекСтрокаГрафик.Сумма;
		иначе
			Движение = Движения.ДвиженияДС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ТекСтрокаГрафик.Период;
			Движение.Статья = Статья;  
			Движение.Кошелек = КошелекКуда;
			Движение.Сумма = ТекСтрокаГрафик.Сумма;
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры
