&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьГрафик();	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафик()
	Объект.График.Очистить();
	Если ЗначениеЗаполнено(СуммаЕжемесячногоПлатежа) Тогда
		Для НомерМесяца=0 По Объект.КолВоМесяцев-1 Цикл
			Строка			= Объект.График.Добавить();
			Строка.Период	= ДобавитьМесяц(Объект.ДатаНачала,НомерМесяца);
			Строка.Сумма	= СуммаЕжемесячногоПлатежа;
		КонецЦикла; 		
		Объект.Сумма = Объект.График.Итог("Сумма");
	Иначе 		
		Если БезОкругления Тогда
			ЕжемесячнаяСумма = Объект.Сумма/Объект.КолвоМесяцев;
		Иначе 
			ЕжемесячнаяСумма = Окр(Объект.Сумма/Объект.КолвоМесяцев,-3);
			Если ЕжемесячнаяСумма = 0  Тогда
				ЕжемесячнаяСумма = Окр(Объект.Сумма/Объект.КолвоМесяцев,-2);
				Если ЕжемесячнаяСумма = 0  Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ежемесячный платеж меньше 100 руб.";
					//Сообщение.Поле = "Сумма"; //имя реквизита 
					//Сообщение.УстановитьДанные(); //Ссылка на объект ИБ
					Сообщение.Сообщить();
					Возврат
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		Остаток =  Объект.Сумма;
		НомерМесяца = 0;
		Пока Остаток > 0 Цикл
			Строка			= Объект.График.Добавить();
			Строка.Период	= ДобавитьМесяц(Объект.ДатаНачала,НомерМесяца);
			Сумма			= Мин(Остаток,ЕжемесячнаяСумма);
			строка.Сумма	= Сумма;
			Остаток			= Остаток - Сумма;
			НомерМесяца		= НомерМесяца + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.КолвоМесяцев = 12;
		Объект.ДатаНачала	= ТекущаяДатаСеанса();
	КонецЕсли;
	Элементы.КошелекКуда.Видимость = Объект.ЭтоПеревод;
КонецПроцедуры


&НаКлиенте
Процедура ЭтоПереводПриИзменении(Элемент)
	Элементы.КошелекКуда.Видимость = Объект.ЭтоПеревод;
КонецПроцедуры

