
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.БюджетРасходы.Записывать = Истина;
	Движения.БюджетДоходы.Записывать = Истина;
	Если ВидБюджета = Перечисления.ВидБюджета.Расход Тогда
		Для Каждого ТекСтрокаГрафик Из График Цикл
			Движение = Движения.БюджетРасходы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ТекСтрокаГрафик.Период;
			Движение.Статья = Статья;
			Движение.Сумма = ТекСтрокаГрафик.Сумма;
			Движение.Проект = Проект;
		КонецЦикла;		
	иначе
		Для Каждого ТекСтрокаГрафик Из График Цикл
			Движение = Движения.БюджетДоходы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ТекСтрокаГрафик.Период;
			Движение.Статья = Статья;
			Движение.Сумма = ТекСтрокаГрафик.Сумма;
			Движение.Проект = Проект;
		КонецЦикла;		
	КонецЕсли;	
	
КонецПроцедуры
