
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДвиженияДС.Записывать = Истина;
	Движение = Движения.ДвиженияДС.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Кошелек = Кошелек;
	Движение.Статья = Статья;
	Движение.Сумма = Сумма;

	Движения.БюджетДоходы.Записывать = Истина;
	
	Движение = Движения.БюджетДоходы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Статья = Статья;
	Движение.Сумма = Сумма;
	
КонецПроцедуры
