
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДвиженияДС.Записывать = Истина;
	Движение = Движения.ДвиженияДС.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Кошелек = КошелекКуда;
	Движение.Сумма = Сумма;
	
	Движение = Движения.ДвиженияДС.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Кошелек = КошелекОткуда;
	Движение.Сумма = Сумма;
		
	Если УчитыватьВБюджете Тогда
		Движения.БюджетРасходы.Записывать = Истина;
		Для каждого строка Из БюджетныйПериод Цикл
			Движение = Движения.БюджетРасходы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = строка.ПериодБюджетирования;
			Движение.Статья = Статья;
			Движение.Сумма = строка.Сумма;
		КонецЦикла;
		ОстатокБюджет = Сумма - БюджетныйПериод.Итог("Сумма");	
			Движение = Движения.БюджетРасходы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Статья = Статья;
			Движение.Сумма = ОстатокБюджет;
	КонецЕсли;
	
КонецПроцедуры
