
Функция СформироватьДанныеДляЗапроса(Контрагент, Пароль = Неопределено, Обновление = Ложь) Экспорт
	ДанныеКонтрагента = новый Соответствие;
	ДанныеКонтрагента.Вставить("id", XMLСтрока(Контрагент));
	ДанныеКонтрагента.Вставить("username", Контрагент.ИНН);
	
	ДанныеКонтрагента.Вставить("full_name", Контрагент.НаименованиеПолное);
	ДанныеКонтрагента.Вставить("tax_id", ?(ЗначениеЗаполнено(Контрагент.ИНН), Контрагент.ИНН, Неопределено));
	ДанныеКонтрагента.Вставить("is_active", НЕ Контрагент.ПометкаУдаления);
	Если Контрагент.Юрлицо = Перечисления.ЮрЛицо.ЮрЛицо Тогда
		ДанныеКонтрагента.Вставить("status","COMP");		
	Иначе 
		ДанныеКонтрагента.Вставить("status","PRIV");				
	КонецЕсли;
	Если ЗначениеЗаполнено(Пароль) Тогда
		ДанныеКонтрагента.Вставить("password", Пароль);				
	КонецЕсли;
	Возврат ДанныеКонтрагента;	
	
КонецФункции
